/*
 *   웹 / 앱
 *   ======
 *   1. 클래스 제작
 *   	=> 캡슐화, 오버라이딩
 *   	   (변수)  (메소드)
 *   	=> 포함 클래스 (재사용 용도로 쓰임)
 *   
 *   2. 데이터연결 => 제어
 *   3. 예외처리
 *   4. IO, 컬렉션
 *   5. 인터페이스
 *   ================================ 변수 / 메소드 (라이브러리 : XML, HTML, JSON)
 */

/*
 * 1. 문법
 * 	  변수 , 클래스 (배열은 가끔 나옴 => ex. 문자열 분리) / 나머지는 대부분 변수, 클래스 사용
 *    메소드 제작방법
 *    ===== 처리 (연산, 제어문)
 *    ========================================== 절차적 언어 (동작 순서로 일괄 코딩 : 재사용 x)
 *    ========================================== 간단한 프로그램 (ex. 계산기...)
 * 2. 객체지향 프로그램 : 대규모
 *    ex. CGV / 롯데시네마 / 메가박스 => (유사한 것들) 재사용 가능
 *     	  지니뮤직 / 멜론 / Mnet    =>  마찬가지
 * 		  서적 (출판사) ==> 장바구니
 * 		  ==> 포함, 상속 (속도가 늦다) : Spring에서는 상속이 없다 => POJO (독립적인 프로그램)
 */
public class 객체지향프로그램 {
			
	public static void main(String[] args) {
		
	}

}
